Revit 2026 API

# FamilyInstanceFlipFromToRoom Method

---

Flips the settings of "From Room" and "To Room" for the door or window instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void FlipFromToRoom()
```
```vb
Public Sub FlipFromToRoom
```
```cpp
public:
void FlipFromToRoom()
```
```fsharp
member FlipFromToRoom : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the FamilyInstance is neither a door nor a window. |

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace